
&НаКлиенте
Процедура Рассчитать(Команда)  
	ДеньКредита=ДатаПолученияЗайма;
	Сумма = СуммаЗайма;
	Процент = 0;  //
	Процент2 = 0; // 
	колВоДней = 0; //
		
	Пока НачалоДня(ДеньКредита)<=НачалоДня(ДатаВозвратаЗайма) Цикл
		
	Если ДеньНедели(ДеньКредита)< 6 Тогда
	КоличествоДнейВГоду = ДеньГода(КонецГода(ДеньКредита));  
	ПроцентыВДень = Сумма * ПроцентнаяСтавкаВГодовых/100/КоличествоДнейВГоду;
	Сумма = Сумма + ПроцентыВДень;
	Процент = 	Процент + ПроцентыВДень; //
 //
	  колВоДней =колВоДней+1;
	КонецЕсли;

	Если ДосрочноеПогашение Тогда 
		Если НачалоДня(ДеньКредита) = НачалоДня(ДатаДосрочногоПогашения) Тогда
			Сумма = Сумма - СуммаДосрочногоПогашения;
			Процент2 = Процент; //
			Процент = 0;  //
				колВоДней = 0; //
		КонецЕсли;
	КонецЕсли;
	
	
    ДеньКредита = ДеньКредита + 86400;
	
КонецЦикла; 

	//Если ДосрочноеПогашение Тогда
	//	СуммаВозврата = Сумма;// - СуммаДосрочногоПогашения;
	//Иначе
	СуммаВозврата = Сумма;
	//КонецЕсли;

          Если ДосрочноеПогашение тогда
    	Переплата = Процент2 +Процент; //
	иначе 
		Переплата = СуммаВозврата - СуммаЗайма;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДосрочноеПогашениеПриИзменении(Элемент)
		Элементы.Группа2.Видимость = ДосрочноеПогашение; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Группа2.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СуммаДосрочногоПогашенияПриИзменении(Элемент)
	Если СуммаДосрочногоПогашения > СуммаЗайма / 2 Тогда
		Сообщить("Сумма досрочного погашения не должна превышать половины суммы займа");
		СуммаДосрочногоПогашения = СуммаЗайма / 2; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаДосрочногоПогашенияПриИзменении(Элемент)
	ОбнулитьДату = Ложь;
	Если НачалоДня(ДатаДосрочногоПогашения) > НачалоДня(ДатаВозвратаЗайма) Тогда
		Сообщить("Дата досрочного погашения не может быть позже даты возврата кредита");
		ОбнулитьДату = Истина;
	КонецЕсли; 
	
	Если НачалоДня(ДатаДосрочногоПогашения) <= НачалоДня(ДатаПолученияЗайма) Тогда
		Сообщить("Дата досрочного погашения не может быть раньше либо равной дате получения займа");
		ОбнулитьДату = Истина;
	КонецЕсли;  
	
	Если ОбнулитьДату Тогда
		ДатаДосрочногоПогашения = Дата("00010101");
	КонецЕсли;
		
КонецПроцедуры
////комментарий





